# Core
brew 'git'
brew 'vim'
brew 'zsh'

# Programming
brew 'node'
brew 'nvm'
brew 'go'
brew 'rbenv'
brew 'python'
brew 'pipx'

# Utilities
brew 'iproute2mac'
brew 'mobile-shell'
brew 'httpie'
brew 'jq'
brew 'ncdu'
brew 'neofetch'
brew 'eza'
brew 'font-hack-nerd-font'
brew 'starship'
brew 'git-secrets'

# Kubernetes
brew 'kubectl'
brew 'helm'
brew 'minikube'
brew 'k9s'
brew 'k3sup'

# Applications
cask 'iterm2'
cask 'wireshark'
cask 'warp'
cask 'obsidian'
cask 'visual-studio-code'
cask 'firefox'
cask 'google-chrome'
cask 'alfred'
cask 'bartender'
cask 'docker'
cask 'todoist'
cask 'spotify'
